app/controllers/home_controller.rb

  def upload
    if (params[:csvfile].present?)
      CSV.parse(params[:csvfile].read, :col_sep =>'|') do |row|
        hours = row[2].split('-')
        service = Service.new(
        :street => row[0],
        :areacode => row[4],
        :city => 'Stockholm',
        :day => row [1],
        :starthour => hours[0],
        :endhour => hours[-1],
        :note => row[5])
        service.save
---
INSERT INTO "services" ("areacode", "city", "created_at", "day", "endhour", "note", "starthour", "street", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"