app/controllers/services_controller.rb

SELECT "services".* FROM "services" WHERE "services"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def show
    @service = Service.find(params[:id])

SELECT distinct(service.street) from services.* FROM "services"
SELECT "services".* FROM "services"
SELECT COUNT(distinct(service.street) from services) FROM "services"
---
  def streets
    @services = Service.select("distinct(street)")

    if !@services.any?

SELECT "services".* FROM "services" WHERE "services"."street" = 'test'
---
  def street
    @services = Service.find_all_by_street(params[:street])

SELECT distinct(areacode) FROM "services"
SELECT COUNT(distinct(areacode)) FROM "services"
---
  def areas
    @services = Service.select("distinct(areacode)")

    if !@services.any?

SELECT "services".* FROM "services" WHERE "services"."areacode" = 'Ku'
---
  def area
    @services = Service.find_all_by_areacode(params[:areacode])

INSERT INTO "services" ("areacode", "city", "created_at", "day", "endhour", "note", "starthour", "street", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    @service = Service.new(params[:service])

    respond_to do |format|
      if @service.save

SELECT "services".* FROM "services" WHERE "services"."id" = $1 LIMIT 1  [["id", "1"]]
DELETE FROM "services" WHERE "services"."id" = $1  [["id", 1]]
---
  def destroy
    @service = Service.find(params[:id])
    @service.destroy